#ifndef __Proverb__
#define __Proverb__

//------------------------------------------------------------------------------
// Rectangle.h - содержит описание класса прямоугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Wisdom.h"

//------------------------------------------------------------------------------
// прямоугольник
class Proverb : public Wisdom
{
public:
	string country, text; // ширина, высота
	// переопределяем интерфейс класса
	void InData(ifstream& ifst);  // ввод данных из потока
	void Out(ofstream& ofst);     // вывод данных в стандартный поток

	// создание без инициализации.
	Proverb() {}
};
#endif
